Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/cru.h
#define CRU_PB3DIV_PBDIV_Pos                  _UINT32_(0)                                          /* (CRU_PB3DIV) PB3 Peripheral Clock Divisor Control value Position */
#define CRU_PB3DIV_PBDIV_Msk                  (_UINT32_(0x7F) << CRU_PB3DIV_PBDIV_Pos)             /* (CRU_PB3DIV) PB3 Peripheral Clock Divisor Control value Mask */
#define CRU_PB3DIV_PBDIV(value)               (CRU_PB3DIV_PBDIV_Msk & (_UINT32_(value) << CRU_PB3DIV_PBDIV_Pos)) /* Assignment of value for PBDIV in the CRU_PB3DIV register */
#define   CRU_PB3DIV_PBDIV_DIV1_Val           _UINT32_(0x0)                                        /* (CRU_PB3DIV) Divide by 1 PB3 Clock same frequency as sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV2_Val           _UINT32_(0x1)                                        /* (CRU_PB3DIV) Divide by 2 PB3 Clock is 1/2 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV3_Val           _UINT32_(0x2)                                        /* (CRU_PB3DIV) Divide by 3 PB3 Clock is 1/3 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV16_Val          _UINT32_(0xF)                                        /* (CRU_PB3DIV) Divide by 16 PB3 Clock is 1/16 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV17_Val          _UINT32_(0x10)                                       /* (CRU_PB3DIV) Divide by 17 PB3 Clock is 1/17 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV127_Val         _UINT32_(0x7E)                                       /* (CRU_PB3DIV) Divide by 127 PB3 Clock is 1/127 of sys_clk  */
#define   CRU_PB3DIV_PBDIV_DIV128_Val         _UINT32_(0x7F)                                       /* (CRU_PB3DIV) Divide by 128 PB3 Clock is 1/128 of sys_clk  */
#define CRU_PB3DIV_PBDIV_DIV1                 (CRU_PB3DIV_PBDIV_DIV1_Val << CRU_PB3DIV_PBDIV_Pos)  /* (CRU_PB3DIV) Divide by 1 PB3 Clock same frequency as sys_clk Position */
#define CRU_PB3DIV_PBDIV_DIV2                 (CRU_PB3DIV_PBDIV_DIV2_Val << CRU_PB3DIV_PBDIV_Pos)  /* (CRU_PB3DIV) Divide by 2 PB3 Clock is 1/2 of sys_clk Position */
#define CRU_PB3DIV_PBDIV_DIV3                 (CRU_PB3DIV_PBDIV_DIV3_Val << CRU_PB3DIV_PBDIV_Pos)  /* (CRU_PB3DIV) Divide by 3 PB3 Clock is 1/3 of sys_clk Position */
#define CRU_PB3DIV_PBDIV_DIV16                (CRU_PB3DIV_PBDIV_DIV16_Val << CRU_PB3DIV_PBDIV_Pos) /* (CRU_PB3DIV) Divide by 16 PB3 Clock is 1/16 of sys_clk Position */
#define CRU_PB3DIV_PBDIV_DIV17                (CRU_PB3DIV_PBDIV_DIV17_Val << CRU_PB3DIV_PBDIV_Pos) /* (CRU_PB3DIV) Divide by 17 PB3 Clock is 1/17 of sys_clk Position */
#define CRU_PB3DIV_PBDIV_DIV127               (CRU_PB3DIV_PBDIV_DIV127_Val << CRU_PB3DIV_PBDIV_Pos) /* (CRU_PB3DIV) Divide by 127 PB3 Clock is 1/127 of sys_clk Position */
#define CRU_PB3DIV_PBDIV_DIV128               (CRU_PB3DIV_PBDIV_DIV128_Val << CRU_PB3DIV_PBDIV_Pos) /* (CRU_PB3DIV) Divide by 128 PB3 Clock is 1/128 of sys_clk Position */
#define CRU_PB3DIV_PBDIVRDY_Pos               _UINT32_(11)                                         /* (CRU_PB3DIV) PB3 Peripheral Clock Divisor Ready Position */
#define CRU_PB3DIV_PBDIVRDY_Msk               (_UINT32_(0x1) << CRU_PB3DIV_PBDIVRDY_Pos)           /* (CRU_PB3DIV) PB3 Peripheral Clock Divisor Ready Mask */
#define CRU_PB3DIV_PBDIVRDY(value)            (CRU_PB3DIV_PBDIVRDY_Msk & (_UINT32_(value) << CRU_PB3DIV_PBDIVRDY_Pos)) /* Assignment of value for PBDIVRDY in the CRU_PB3DIV register */
#define   CRU_PB3DIV_PBDIVRDY_PB3RDY_Val      _UINT32_(0x1)                                        /* (CRU_PB3DIV) Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written.  */
#define   CRU_PB3DIV_PBDIVRDY_NOT_PB3RDY_Val  _UINT32_(0x0)                                        /* (CRU_PB3DIV) Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written.  */
#define CRU_PB3DIV_PBDIVRDY_PB3RDY            (CRU_PB3DIV_PBDIVRDY_PB3RDY_Val << CRU_PB3DIV_PBDIVRDY_Pos) /* (CRU_PB3DIV) Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written. Position */
#define CRU_PB3DIV_PBDIVRDY_NOT_PB3RDY        (CRU_PB3DIV_PBDIVRDY_NOT_PB3RDY_Val << CRU_PB3DIV_PBDIVRDY_Pos) /* (CRU_PB3DIV) Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written. Position */
#define CRU_PB3DIV_PBDIVON_Pos                _UINT32_(15)                                         /* (CRU_PB3DIV) Output Enable bit Position */
#define CRU_PB3DIV_PBDIVON_Msk                (_UINT32_(0x1) << CRU_PB3DIV_PBDIVON_Pos)            /* (CRU_PB3DIV) Output Enable bit Mask */
#define CRU_PB3DIV_PBDIVON(value)             (CRU_PB3DIV_PBDIVON_Msk & (_UINT32_(value) << CRU_PB3DIV_PBDIVON_Pos)) /* Assignment of value for PBDIVON in the CRU_PB3DIV register */
#define   CRU_PB3DIV_PBDIVON_PB3ON_Val        _UINT32_(0x1)                                        /* (CRU_PB3DIV) PB3 Output clock is enabled  */
#define   CRU_PB3DIV_PBDIVON_PB3OFF_Val       _UINT32_(0x0)                                        /* (CRU_PB3DIV) PB3 Output clock is disabled  */
#define CRU_PB3DIV_PBDIVON_PB3ON              (CRU_PB3DIV_PBDIVON_PB3ON_Val << CRU_PB3DIV_PBDIVON_Pos) /* (CRU_PB3DIV) PB3 Output clock is enabled Position */
#define CRU_PB3DIV_PBDIVON_PB3OFF             (CRU_PB3DIV_PBDIVON_PB3OFF_Val << CRU_PB3DIV_PBDIVON_Pos) /* (CRU_PB3DIV) PB3 Output clock is disabled Position */
#define CRU_PB3DIV_Msk                        _UINT32_(0x0000887F)                                 /* (CRU_PB3DIV) Register Mask  */


/* -------- CRU_PB3DIVCLR : (CRU Offset: 0x184) (R/W 32)  -------- */
#define CRU_PB3DIVCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB3DIVCLR)   Reset Value */

#define CRU_PB3DIVCLR_Msk                     _UINT32_(0x00000000)                                 /* (CRU_PB3DIVCLR) Register Mask  */


/* -------- CRU_PB3DIVSET : (CRU Offset: 0x188) (R/W 32)  -------- */
#define CRU_PB3DIVSET_RESETVALUE              _UINT32_(0x00)                                       /*  (CRU_PB3DIVSET)   Reset Value */

